XMLParserTests/Locations.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="urn:dictionary:com.chargepoint.webservices">
    <SOAP-ENV:Header xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
        <wsse:Security SOAP-ENV:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>229288021aeb37cf322b01a8de04958057dc1f02374d71474043650</wsse:Username>
                <wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">d3ab3ab260ad46f74c3b72a42fc9a946</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <ns1:getPublicStations>
            <searchQuery>
                <stationManufacturer></stationManufacturer>
                <stationModel></stationModel>
                <stationName></stationName>
                <Address></Address>
                <City></City>
                <State></State>
                <Country></Country>
                <postalCode></postalCode>
                <Proximity>1</Proximity>
                <proximityUnit>M</proximityUnit>
                <Connector></Connector>
                <Voltage></Voltage>
                <Current></Current>
                <Power></Power>
                <demoSerialNumber/>
                <Reservable></Reservable>
                <Geo>
                    <Lat>37.2615</Lat>
                    <Long>-121.9577</Long>
                </Geo>
                <Pricing>
                    <startTime></startTime>
                    <Duration></Duration>
                    <energyRequired></energyRequired>
                    <vehiclePower></vehiclePower>
                </Pricing>
            </searchQuery>
        </ns1:getPublicStations>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
